app/controllers/brands_controller.rb

SELECT "brands".* FROM "brands" WHERE "brands"."id" = 1 LIMIT 1
---
  def show
    #creates a session for that brand
    session[:brand] = current_user.account.brands.find(params[:id]).id