app/controllers/brands_controller.rb

  def create
    @brand = Brand.new(params[:brand])
    if @brand.save
---
INSERT INTO "brands" ("name", "created_at", "updated_at") VALUES ('expedita', '2011-08-13 19:27:56.342218', '2011-08-13 19:27:56.342218')