app/controllers/dashboard_controller.rb

SELECT "brands".* FROM "brands" LIMIT 1
SELECT "brands".* FROM "brands" WHERE "brands"."id" = 1 LIMIT 1
---
  def index
    if session[:brand].nil?
      session[:brand] = Brand.first.id
    end
    brand = Brand.find(session[:brand])