app/controllers/domains_controller.rb

  def index
    if !BrandSetting.with_domain(request.host).blank?
---
SELECT "brand_settings".* FROM "brand_settings" WHERE (brand_settings.name = 'domain')