app/views/layouts/_brand.html.erb

SELECT "brands".* FROM "brands" WHERE "brands"."id" = 1 LIMIT 1
---
<% if session[:brand]%>
<% if Brand.find(session[:brand]).name=='Sext'%>