app/views/layouts/_toolbar.html.erb

SELECT "brands".* FROM "brands"
---
<div id="toolbar">
	<% Brand.all.each do |brand| %>